# GetTaggedReferences Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..GetTaggedReferences Method
IndependentTag Class See Also
---
Get the host references of the tag. An array of all the tagged references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public IList<Reference> GetTaggedReferences()
```

Visual Basic
---
```text
Public Function GetTaggedReferences As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetTaggedReferences()
```

# Remarks
The references can be to an element or subelement in a local or linked document.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace